# file สำหรับเขียนคำตอบ
# ในกรณีที่มีการสร้าง function อื่น ๆ ให้ระบุว่า input-output คืออะไรด้วย
'''
ธัญชนก_6463
'''
#=============================================<คำตอบข้อ 1>======================================================#
#code here
def endEffectorJacobianHW3(q:list[float])->list[float]:
    z_1 = [r1_31, r1_32, r1_33]
    z_2 = [r2_31, r2_32, r2_33]
    z_3 = [r3_31, r3_32, r3_33]
    J_e = np.array(z_1*(p_e-P[:,0]), z_2*(p_e-P[:,1]), z_3*(p_e-P[:,2]), z_1, z_2, z_3).reshape(6,3)
    return J_e
#==============================================================================================================#
#=============================================<คำตอบข้อ 2>======================================================#
#code here
def checkSingularityHW3(q:list[float])->bool:
    epsilon = 0.001
    J_e = endEffectorJacobianHW3(q)
    J_star = J_e[:3, :]
    det_J_star = np.linalg.det(J_star)
    if abs(det_J_star) < epsilon:
        return 1
    else:
        return 0
#==============================================================================================================#
#=============================================<คำตอบข้อ 3>======================================================#
#code here
def computeEffortHW3(q:list[float], w:list[float])->list[float]:
    J_e = endEffectorJacobianHW3(q)
    J_T = np.transpose(J_e)
    tau = J_T*w
    return tau
#==============================================================================================================#