# file สำหรับตรวจคำตอบ
# ในกรณีที่มีการสร้าง function อื่น ๆ ให้ระบุว่า input-output คืออะไรด้วย
'''
ธัญชนก_6463
'''
#===========================================<ตรวจคำตอบข้อ 1>====================================================#
#code here
q_test = [0, 0, 0] #ค่าเริ่มต้น
R, P, R_e, p_e = FKHW3(q_test)
J_e = endEffectorJacobianHW3(q_test)
#==============================================================================================================#
#===========================================<ตรวจคำตอบข้อ 2>====================================================#
#code here
q_singular = [0, -np.pi/2, np.pi/2] #ค่าที่คาดว่าจะเกิดสภาวะSingularity
flag = checkSingularityHW3(q_singular) #flag=1 จะอยู่ในสภาวะSingularity
#==============================================================================================================#
#===========================================<ตรวจคำตอบข้อ 3>====================================================#
#code here
w_test = [0, 0, 0, 0, 0, 0] #เมื่อไม่มีแรงกระทำ
tau = computeEffortHW3(q_test, w_test)
#==============================================================================================================#